---
kind: other
id: Properties.T:Autodesk.Revit.DB.FilterCategoryRule
source: html/b72acdf5-9fb9-6b5e-cae8-6b5edba068a8.htm
---
# FilterCategoryRule Properties

Specifies whether the .NET object represents a valid Revit entity.